
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеПоОкладуСотрудники.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Документ.НачислениеПоОкладу.Сотрудники КАК НачислениеПоОкладуСотрудники
	|ГДЕ
	|	НачислениеПоОкладуСотрудники.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.Оклад КАК Оклад
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ВТ_Сотрудники.Сотрудник = Сотрудники.Ссылка
	|ГДЕ
	|	Сотрудники.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_Сотрудники КАК ВТ_Сотрудники)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.Зарплата.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.ОплатаПоОкладу;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Показатель = Выборка.Оклад;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
	КонецЦикла;
	
	Движения.Зарплата.Записать();
	
	Для каждого Движение Из Движения.Зарплата Цикл
		
		Отбор = Новый Структура("Регистратор, Сотрудник", Ссылка, Движение.Сотрудник);
		Норма = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор, 
		ВидПериодаРегистраРасчета.ПериодДействия)[0].РабочийДень;
		Факт = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор, 
		ВидПериодаРегистраРасчета.ФактическийПериодДействия)[0].РабочийДень;
		Оклад = Движение.Показатель;
		Движение.Сумма = ?(Норма = 0, 0, Оклад * Факт / Норма);	
		
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);
	
КонецПроцедуры
