Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Контрагент = Поставщик;
	Движение.Сумма = Сумма;
	Движение.Период = Дата;
	
	Движения.Товары.Записывать = Истина;
	Движения.Товары.Очистить();
	Движения.Товары.Записать();
	
	Движения.Расходы.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	                |	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура.Тип КАК ТипНоменклатуры,
	                |	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	                |	ПоступлениеТоваровИУслугТоварыИУслуги.Количество КАК Количество,
	                |	ПоступлениеТоваровИУслугТоварыИУслуги.Сумма КАК Сумма
	                |ИЗ
	                |	Документ.ПоступлениеТоваровИУслуг.ТоварыИУслуги КАК ПоступлениеТоваровИУслугТоварыИУслуги
	                |ГДЕ
	                |	ПоступлениеТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("ССылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.Управленческий.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Сумма = Выборка.Сумма;
			Движение.Количество = Выборка.Количество;
		Иначе
			Движение = Движения.Расходы.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Сумма = Выборка.Сумма;
		КонецЕсли;
		
		Проводка = Движения.Управленческий.Добавить();
		Проводка.Период = Дата;
		Проводка.СчетДт = ПланыСчетов.Управленческий.Товары;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
		Проводка.СчетКт = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Поставщик;
		Проводка.Сумма = Выборка.Сумма;
		Проводка.Количество = Выборка.Количество;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = ТоварыИУслуги.Итог("Сумма");
	
КонецПроцедуры



