
&НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииКоличества(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока);
	
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Количество * ИзмененнаяСтрока.Цена;
	ПриИзмененииСуммы(ИзмененнаяСтрока);

КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииЦены(ИзмененнаяСтрока);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока);
	
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Количество * ИзмененнаяСтрока.Цена;
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока);
	
	Если ИзмененнаяСтрока.Количество = 0 Тогда
		Возврат;
	Иначе
		ИзмененнаяСтрока.Цена = ИзмененнаяСтрока.Сумма / ИзмененнаяСтрока.Количество;	
	КонецЕсли;
	
	Сумма = ИзмененнаяСтрока.Сумма;
	СтавкаНДС = ИзмененнаяСтрока.СтавкаНДС;
	СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(Сумма,СтавкаНДС);
	ИзмененнаяСтрока.СуммаНДС = СуммаНДС;
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииСтавкиНДС(ИзмененнаяСтрока);
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока);
	
	Сумма = ИзмененнаяСтрока.Сумма;
	СтавкаНДС = ИзмененнаяСтрока.СтавкаНДС;
	СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(Сумма,СтавкаНДС);
	ИзмененнаяСтрока.СуммаНДС = СуммаНДС;
КонецПроцедуры
