Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Контрагент = Покупатель;
	Движение.Сумма = Сумма;
	Движение.Период = Дата;
	
	Движения.Товары.Записывать = Истина;
	Движения.Товары.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	|	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Количество) КАК Количество,
	|	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура.Тип КАК НоменклатураТип,
	|	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.ТоварыИУслуги КАК РеализацияТоваровИУслугТоварыИУслуги
	|ГДЕ
	|	РеализацияТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура.Тип,
	|	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеДокумента.Количество КАК Количество,
	|	ВТ_ДанныеДокумента.НоменклатураТип КАК ВидНоменклатуры,
	|	ВТ_ДанныеДокумента.Сумма КАК Сумма,
	|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Товары.Остатки(
	|				&Период,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК ТоварыОстатки
	|		ПО ВТ_ДанныеДокумента.Номенклатура = ТоварыОстатки.Номенклатура";
	
		
	
	Запрос.УстановитьПараметр("ССылка",Ссылка);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	
	Пока Выборка.Следующий() Цикл
		
		Движения.Доходы.Записывать = Истина;
		Движение = Движения.Доходы.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Сумма = Выборка.Сумма;
		Движение.Количество = Выборка.Количество;
		
		Если Выборка.ВидНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
			Продолжить;
		КонецЕсли;
		
		НехваткаТовара = Выборка.Количество - Выборка.КоличествоОстаток;
		
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Недостает " + НехваткаТовара + " единиц товара " + Выборка.Номенклатура;
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			Продолжить;
			
		КонецЕсли;
		
		Если Выборка.Количество = Выборка.КоличествоОстаток Тогда
			Себестоимость = Выборка.СуммаОстаток;
		Иначе;
			Себестоимость = Выборка.СуммаОстаток * Выборка.Количество / Выборка.КоличествоОстаток;
			
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата; 
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Количество = Выборка.Количество;
			Движение.Сумма = Себестоимость;
		КонецЕсли;
		
		Движения.Расходы.Записывать = Истина;
		
		Движение = Движения.Расходы.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Сумма = Себестоимость;
		
		//Проводка = Движения.Управленческий.Добавить();
		//Проводка.Период = Дата;
		//Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
		//Проводка.СчетКт = ПланыСчетов.Управленческий.Товары;
		//Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
		//Проводка.Сумма = Себестоимость;
		
	КонецЦикла;
	
	Проводка = Движения.Управленческий.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Покупатель;
	Проводка.СчетКт = ПланыСчетов.Управленческий.Выручка;
	Проводка.Сумма = Сумма; 
	
	СформироватьДвижениеПоСчетуТовары();
	
КонецПроцедуры 

Процедура СформироватьДвижениеПоСчетуТовары()
	
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	|	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Количество) КАК Количество,
	|	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТоварыИУслуги
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.ТоварыИУслуги КАК РеализацияТоваровИУслугТоварыИУслуги
	|ГДЕ
	|	РеализацияТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыИУслуги.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыИУслуги.Количество КАК Количество,
	|	ВТ_ТоварыИУслуги.Сумма КАК Сумма,
	|	ЕСТЬNULL(УправленческийОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(УправленческийОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_ТоварыИУслуги КАК ВТ_ТоварыИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	|				&Период,
	|				Счет = &СчетТовары,
	|				&Субконто,
	|				Субконто1 В
	|					(ВЫБРАТЬ
	|						ВТ_ТоварыИУслуги.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_ТоварыИУслуги КАК ВТ_ТоварыИУслуги)) КАК УправленческийОстатки
	|		ПО ВТ_ТоварыИУслуги.Номенклатура = УправленческийОстатки.Субконто1";
	
	Запрос.УстановитьПараметр("ССылка",Ссылка);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетТовары",ПланыСчетов.Управленческий.Товары);
	Запрос.УстановитьПараметр("Субконто", ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если Выборка.Количество = Выборка.КоличествоОстаток Тогда
			Себестоимость = Выборка.СуммаОстаток;
		ИначеЕсли Выборка.КоличествоОстаток	= 0 Тогда
			Возврат;
		Иначе
			Себестоимость = Выборка.Количество * Выборка.СуммаОстаток / Выборка.КоличествоОстаток;
		КонецЕсли;
		
	Движение = Движения.Управленческий.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.Управленческий.Расходы;
	Движение.СчетКт = ПланыСчетов.Управленческий.Товары;
	Движение.Сумма = Себестоимость;
	Движение.Количество = Выборка.Количество;
	Движение.СубконтоКт = Выборка.Номенклатура;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = ТоварыИУслуги.Итог("Сумма");
	
КонецПроцедуры



