
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗначенияЗаполнения = Новый Структура("ВедущаяЗадача", ПараметрКоманды); //Выбираем реквизит Задачи, который нужно заполнить и каким значением его нужно заполнить
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения); //Выбираем реквизит формы, которую будем открывать и выбираем значение, для этого реквизита
	
	ОткрытьФорму("БизнесПроцесс.Поручение.ФормаОбъекта", ПараметрыФормы); //Открываем форму и уточняем, какую именно форму, указываем какой реквизит формы заполнить и каким значением
	
КонецПроцедуры
