
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Цены.Очистить();
	Движения.Цены.Записать();
	Движения.Цены.Записывать = Истина;
	
	Для Каждого ТекСтрока Из Цены Цикл
		
		Движение = Движения.Цены.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрока.Номенклатура;
		Движение.Цена = ТекСтрока.Цена;
		
	КонецЦикла;
	
КонецПроцедуры

