
&НаКлиенте
Процедура СлучайныйПароль(Команда)
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Пароль = "";
	Неиспользуемые = ":<=>?@;[\]^_`";
	Пока СтрДлина(Пароль) < 6 Цикл
		СимволПароля = Символ(ГСЧ.СлучайноеЧисло(48, 122));
		Если Найти(Неиспользуемые, СимволПароля) > 0 Тогда 
			Продолжить;
		КонецЕсли;
		Пароль = Пароль + СимволПароля;
	КонецЦикла;
	Элементы.Пароль.РежимПароля = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ); 
	
	Если НЕ ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ) ИЛИ Пользователь = Неопределено Тогда
		ВходРазрешен = Ложь;
		ИмяДляВхода = "";
		Пароль = "";
		Возврат;
	Иначе
		ИмяДляВхода = Пользователь.Имя;
		Пароль = Пользователь.СохраняемоеЗначениеПароля;
		ВходРазрешен = Пользователь.АутентификацияСтандартная;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
	
	Если Пользователь <> Неопределено Тогда
		
		Пользователь.Имя = ИмяДляВхода;
		Пользователь.АутентификацияСтандартная = ВходРазрешен;
		Пользователь.Пароль = Пароль;
		Пользователь.Записать();
	ИначеЕсли ВходРазрешен  И НЕ ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ) Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = ИмяДляВхода;
		Пользователь.АутентификацияСтандартная = ВходРазрешен;
		Пользователь.ПолноеИмя = Объект.Наименование;
		Пользователь.Пароль = Пароль;
		Пользователь.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
		Пользователь.Записать();
		
		ТекущийОбъект.ИдентификаторПользователяИБ = Пользователь.УникальныйИдентификатор;
		
		Если НЕ ЗначениеЗаполнено(ИмяДляВхода) Тогда
			
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
		
	КонецПроцедуры


