Функция ЦенаНаДату(Номенклатура, Дата)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Результат.Пустой() Тогда
		Цена = 0;
	Иначе
		Пока Выборка.Следующий() Цикл
			Цена = Выборка.Цена;	
		КонецЦикла;
	КонецЕсли;
	
	Возврат Цена;
	
КонецФункции

Функция СкидкаНаДату(НоменклатураНоменклатурнаяГруппа, Дата) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкидкиСрезПоследних.Скидка КАК Скидка
	|ИЗ
	|	РегистрСведений.Скидки.СрезПоследних(&Период, НоменклатураНоменклатурнаяГруппа = &Номенклатура) КАК СкидкиСрезПоследних";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Номенклатура",НоменклатураНоменклатурнаяГруппа); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Скидка = 0;
	
	Если Выборка.Следующий() Тогда
		Скидка = Выборка.Скидка;
	ИначеЕсли ТипЗнч(НоменклатураНоменклатурнаяГруппа) = Тип("СправочникСсылка.Номенклатура") Тогда
		Запрос.УстановитьПараметр("Номенклатура", НоменклатураНоменклатурнаяГруппа.НоменклатурнаяГруппа);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Скидка = Выборка.Скидка;
		КонецЕсли;
	КонецЕсли;	
	Возврат Скидка;
	
КонецФункции
