Функция СуммаНДСПоСтавке(Сумма, СтавкаНДС) Экспорт 
	
	Перем ПроцентНДС;
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		ПроцентНДС = 0;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка") Тогда
		ПроцентНДС = 0;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		ПроцентНДС = 10;
	Иначе	
		ПроцентНДС = 20;
	КонецЕсли;
	
	СуммаНДС = Сумма * ПроцентНДС * 0.01 / (1 + ПроцентНДС * 0.01);
	Возврат СуммаНДС;
	
КонецФункции